app/views/songs/_form.html.erb

SELECT "artists".* FROM "artists"
---
  <% if @song.artist.nil? %>
    <%= f.select :artist_id, Artist.all.collect { |a| [ a.name, a.id ] }, include_blank: true %>